examples/flows/compiled/inline_comment_overrides/flow.mmd
flowchart TD
    %% Flow: order_pipeline

    charge_payment[charge_payment]
    end_order_pipeline([end_order_pipeline])
    router_order_pipeline_line_27_seq_3{{router_order_pipeline_line_27_seq_3}}
    router_order_pipeline_line_32_if_2{{router_order_pipeline_line_32_if_2}}
    router_order_pipeline_line_33_seq_1{{router_order_pipeline_line_33_seq_1}}
    start_order_pipeline([start_order_pipeline])
    validate_order[validate_order]

    start_order_pipeline --> router_order_pipeline_line_27_seq_3
    router_order_pipeline_line_33_seq_1 --> end_order_pipeline
    router_order_pipeline_line_32_if_2 -->|not (p.get('fraud_score', 0) > 0.8)| charge_payment
    router_order_pipeline_line_32_if_2 -->|p.get('fraud_score', 0) > 0.8| router_order_pipeline_line_33_seq_1
    router_order_pipeline_line_27_seq_3 --> validate_order
    validate_order --> router_order_pipeline_line_32_if_2
    charge_payment --> end_order_pipeline
